# Методы обработки строк
# Методы не изменяют сами объекты, а работают с их копией
data = 'Hello World'

# Заменяет все вхождения подстроки old на подстроку new
data1 = data.replace('l', '1')

# Заменяет count вхождений подстроки old на подстроку new
data1 = data.replace('l', '1', 2)

# Удаляет все пробельные символы в начале и в конце строки
# Пробельные символы - пробел, tab, \n
data1 = data.strip()

# Удаляет все указанные символы в начале и в конце строки
data1 = data.strip('*#')

data1 = data.lstrip()
data1 = data.rstrip()

# Разделяет строку на подстроки по пробелу, возвращает список
data1 = data.split()

# Разделяет строку на подстроки по заданной подстроке, возвращает список
data = data.split('ll')

# Возвращает кол-во вхождений подстроки в строку
cnt = data.count('l')


# Срезы
# Стандартная нумерация любой строки - слева направо от 0
# Обратная нумерация - справа налево от -1

data = 'Hello World!'
print(data[0:5]) # Срез с 0 позиции по 5 не включительно
print(data[:5]) # Срез от начала строки до 5 позиции не вкл.
print(data[5:]) # Срез от 5 до конца строки
print(data[6:-1]) # Срез от 6 позиции до последней не вкл.
print(data[-6:-1])

print(data[::2]) # Срез от начала до конца с шагом 2
print(data[::-1]) # Каждый 1 симфол с конца строки до начала


