# Условный оператор

# Порядок выполнения операций в Python
# 1. ()
# 2. **
# 3. *, /, //, %
# 4. +, -
# 5. <, >, <=, >=, ==, !=
# 6. not (инверсия, логическое отрицание)
# 7. and (конъюнкция, логическое умножение)
# 8. or (дизъюнкция, логическое сложение)

# Тернарный оператор
num = 5
if num % 2 == 0:
    print('Делится')
else:
    print("Не делится")

print('Делится' if num % 2 == 0 else "Не делится")

# Задача на тернарный оператор
# C клавиатуры считывается число.
# Если оно четное, то увеличивается на 1, в противном случае не увеличивается.

num1 = int(input())
print( num1 + 1 if num % 2 == 0 else num)

num = int(input())

if num > 0:
    print("+")
elif num < 0:
    print('-')
else:
    print('0')

####################################

num = int(input())

if  0 <= num < 7:
    print("Дошкольник")
elif 7 <= num < 18:
    print('Школьник')
elif 18 <= num < 22:
    print('Студент')
elif 22 <= num < 65:
    print('Рабочий')
else:
    print("Пенсионер")

